In [ ]:
'''
@Author:Shivam Mathur
@Date:2021-07-13
@Last Modified by:Shivam Mathur
@Last Modified time:2021-07-13
@Title:Write a Python program to insert a new column in existing DataFrame.
'''

In [ ]:
'''
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew',
'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
'''

In [1]:
import numpy as np
import pandas as pd

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew',
'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
exam_df=pd.DataFrame(exam_data,labels)

In [4]:
city=['bhopal','indore','gwalior','betul','hosanghabad','barwani','seoni','mandla','jabalpur','satna']

In [6]:
exam_df["city"]=city

In [7]:
exam_df

        name  score  attempts qualify         city
a  Anastasia   12.5         1     yes       bhopal
b       Dima    9.0         3      no       indore
c  Katherine   16.5         2     yes      gwalior
d      James    NaN         3      no        betul
e      Emily    9.0         2      no  hosanghabad
f    Michael   20.0         3     yes      barwani
g    Matthew   14.5         1     yes        seoni
h      Laura    NaN         1      no       mandla
i      Kevin    8.0         2      no     jabalpur
j      Jonas   19.0         1     yes        satna